Zhiyi-Zhang/ndn-riot-tests/board-test/nrf52840/src/nrf_802154_swi.c
/* Copyright (c) 2017 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 *   1. Redistributions of source code must retain the above copyright notice, this
 *      list of conditions and the following disclaimer.
 *
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *
 *   3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *      contributors may be used to endorse or promote products derived from
 *      this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

/**
 * @file
 *   This file implements SWI manager for nRF 802.15.4 driver.
 *
 */

#include "nrf_802154_swi.h"

#include <assert.h>
#include <stdbool.h>
#include <stdint.h>

#include "nrf_802154.h"
#include "nrf_802154_config.h"
#include "nrf_802154_core.h"
#include "nrf_802154_rsch.h"
#include "nrf_802154_rx_buffer.h"
#include "../external/hal/nrf_egu.h"


/** Size of notification queue.
 *
 * One slot for each receive buffer, one for transmission, one for busy channel and one for energy
 * detection.
 */
#define NTF_QUEUE_SIZE (NRF_802154_RX_BUFFERS + 3)
/** Size of requests queue.
 *
 * Two is minimal queue size. It is not expected in current implementation to queue a few requests.
 */
#define REQ_QUEUE_SIZE 2

#define SWI_EGU        NRF_802154_SWI_EGU_INSTANCE    ///< Label of SWI peripheral.
#define SWI_IRQn       NRF_802154_SWI_IRQN            ///< Symbol of SWI IRQ number.
#define SWI_IRQHandler NRF_802154_SWI_IRQ_HANDLER     ///< Symbol of SWI IRQ handler.

#define NTF_INT   NRF_EGU_INT_TRIGGERED0              ///< Label of notification interrupt.
#define NTF_TASK  NRF_EGU_TASK_TRIGGER0               ///< Label of notification task.
#define NTF_EVENT NRF_EGU_EVENT_TRIGGERED0            ///< Label of notification event.

#define TIMESLOT_EXIT_INT   NRF_EGU_INT_TRIGGERED1    ///< Label of timeslot exit interrupt.
#define TIMESLOT_EXIT_TASK  NRF_EGU_TASK_TRIGGER1     ///< Label of timeslot exit task.
#define TIMESLOT_EXIT_EVENT NRF_EGU_EVENT_TRIGGERED1  ///< Label of timeslot exit event.

#define REQ_INT   NRF_EGU_INT_TRIGGERED2              ///< Label of request interrupt.
#define REQ_TASK  NRF_EGU_TASK_TRIGGER2               ///< Label of request task.
#define REQ_EVENT NRF_EGU_EVENT_TRIGGERED2            ///< Label of request event.

#define RAW_LENGTH_OFFSET  0
#define RAW_PAYLOAD_OFFSET 1

/// Types of notifications in notification queue.
typedef enum
{
    NTF_TYPE_RECEIVED,                 ///< Frame received
    NTF_TYPE_RECEIVE_FAILED,           ///< Frame reception failed
    NTF_TYPE_TRANSMITTED,              ///< Frame transmitted
    NTF_TYPE_TRANSMIT_FAILED,          ///< Frame transmission failure
    NTF_TYPE_ENERGY_DETECTED,          ///< Energy detection procedure ended
    NTF_TYPE_ENERGY_DETECTION_FAILED,  ///< Energy detection procedure failed
    NTF_TYPE_CCA,                      ///< CCA procedure ended
    NTF_TYPE_CCA_FAILED,               ///< CCA procedure failed
} nrf_802154_ntf_type_t;

/// Notification data in the notification queue.
typedef struct
{
    nrf_802154_ntf_type_t type;  ///< Notification type.
    union
    {
        struct
        {
            uint8_t              * p_psdu;   ///< Pointer to received frame PSDU.
            int8_t                 power;    ///< RSSI of received frame.
            int8_t                 lqi;      ///< LQI of received frame.
        } received;                          ///< Received frame details.

        struct
        {
            nrf_802154_rx_error_t  error;    ///< An error code that indicates reason of the failure.
        } receive_failed;

        struct
        {
            const uint8_t        * p_frame;  ///< Pointer to frame that was transmitted.
            uint8_t              * p_psdu;   ///< Pointer to received ACK PSDU or NULL.
            int8_t                 power;    ///< RSSI of received ACK or 0.
            int8_t                 lqi;      ///< LQI of received ACK or 0.
        } transmitted;                       ///< Transmitted frame details.

        struct
        {
            const uint8_t        * p_frame;  ///< Pointer to frame that was requested to be transmitted, but failed.
            nrf_802154_tx_error_t  error;    ///< An error code that indicates reason of the failure.
        } transmit_failed;

        struct
        {
            int8_t                 result;   ///< Energy detection result.
        } energy_detected;                   ///< Energy detection details.

        struct
        {
            nrf_802154_ed_error_t  error;    ///< An error code that indicates reason of the failure.
        } energy_detection_failed;           ///< Energy detection failure details.

        struct
        {
            bool                   result;   ///< CCA result.
        } cca;                               ///< CCA details.

        struct
        {
            nrf_802154_cca_error_t error;    ///< An error code that indicates reason of the failure.
        } cca_failed;                        ///< CCA failure details.
    } data;                                  ///< Notification data depending on it's type.
} nrf_802154_ntf_data_t;

