Zhiyi-Zhang/ndn-riot-tests/board-test/nrf52840/src/nrf_802154_swi.c
/// Type of requests in request queue.
typedef enum
{
    REQ_TYPE_SLEEP,
    REQ_TYPE_RECEIVE,
    REQ_TYPE_TRANSMIT,
    REQ_TYPE_ENERGY_DETECTION,
    REQ_TYPE_CCA,
    REQ_TYPE_CONTINUOUS_CARRIER,
    REQ_TYPE_BUFFER_FREE,
    REQ_TYPE_CHANNEL_UPDATE,
    REQ_TYPE_CCA_CFG_UPDATE
} nrf_802154_req_type_t;

/// Request data in request queue.
typedef struct
{
    nrf_802154_req_type_t type;  ///< Type of the request.
    union
    {
        struct
        {
            nrf_802154_term_t term_lvl;                  ///< Request priority.
            bool            * p_result;                  ///< Sleep request result.
        } sleep;                                         ///< Sleep request details.

        struct
        {
            nrf_802154_notification_func_t notif_func;   ///< Error notified in case of success.
            nrf_802154_term_t              term_lvl;     ///< Request priority.
            req_originator_t               req_orig;     ///< Request originator.
            bool                           notif_abort;  ///< If function termination should be notified.
            bool                         * p_result;     ///< Receive request result.
        } receive;                                       ///< Receive request details.

        struct
        {
            nrf_802154_notification_func_t notif_func;   ///< Error notified in case of success.
            nrf_802154_term_t              term_lvl;     ///< Request priority.
            req_originator_t               req_orig;     ///< Request originator.
            const uint8_t                * p_data;       ///< Pointer to PSDU to transmit.
            bool                           cca;          ///< If CCA was requested prior to transmission.
            bool                           immediate;    ///< If TX procedure must be performed immediately.
            bool                         * p_result;     ///< Transmit request result.
        } transmit;                                      ///< Transmit request details.

        struct
        {
            nrf_802154_term_t term_lvl;                  ///< Request priority.
            bool            * p_result;                  ///< Energy detection request result.
            uint32_t          time_us;                   ///< Requested time of energy detection procedure.
        } energy_detection;                              ///< Energy detection request details.

        struct
        {
            nrf_802154_term_t term_lvl;                  ///< Request priority.
            bool            * p_result;                  ///< CCA request result.
        } cca;                                           ///< CCA request details.

        struct
        {
            nrf_802154_term_t term_lvl;                  ///< Request priority.
            bool            * p_result;                  ///< Continuous carrier request result.
        } continuous_carrier;                            ///< Continuous carrier request details.

        struct
        {
            uint8_t * p_data;                            ///< Pointer to receive buffer to free.
            bool    * p_result;                          ///< Buffer free request result.
        } buffer_free;                                   ///< Buffer free request details.

        struct
        {
            bool * p_result;                             ///< Channel update request result.
        } channel_update;                                ///< Channel update request details.

        struct
        {
            bool * p_result;                             ///< CCA config update request result.
        } cca_cfg_update;                                ///< CCA config update request details.
    } data;                                              ///< Request data depending on it's type.
} nrf_802154_req_data_t;

static nrf_802154_ntf_data_t m_ntf_queue[NTF_QUEUE_SIZE];  ///< Notification queue.
static uint8_t               m_ntf_r_ptr;                  ///< Notification queue read index.
static uint8_t               m_ntf_w_ptr;                  ///< Notification queue write index.

static nrf_802154_req_data_t m_req_queue[REQ_QUEUE_SIZE];  ///< Request queue.
static uint8_t               m_req_r_ptr;                  ///< Request queue read index.
static uint8_t               m_req_w_ptr;                  ///< Request queue write index.

/**
 * Increment given index for any queue.
 *
 * @param[inout]  p_ptr       Index to increment.
 * @param[in]     queue_size  Number of elements in the queue.
 */
static void queue_ptr_increment(uint8_t * p_ptr, uint8_t queue_size)
{
    if (++(*p_ptr) >= queue_size)
    {
        *p_ptr = 0;
    }
}

/**
 * Check if given queue is full.
 *
 * @param[in]  r_ptr       Read index associated with given queue.
 * @param[in]  w_ptr       Write index associated with given queue.
 * @param[in]  queue_size  Number of elements in the queue.
 *
 * @retval  true   Given queue is full.
 * @retval  false  Given queue is not full.
 */
static bool queue_is_full(uint8_t r_ptr, uint8_t w_ptr, uint8_t queue_size)
{
    if (w_ptr == (r_ptr - 1))
    {
        return true;
    }

    if ((r_ptr == 0) && (w_ptr == queue_size - 1))
    {
        return true;
    }

    return false;
}

/**
 * Check if given queue is empty.
 *
 * @param[in]  r_ptr  Read index associated with given queue.
 * @param[in]  w_ptr  Write index associated with given queue.
 *
 * @retval  true   Given queue is empty.
 * @retval  false  Given queue is not empty.
 */
static bool queue_is_empty(uint8_t r_ptr, uint8_t w_ptr)
{
    return (r_ptr == w_ptr);
}

/**
 * Increment given index associated with notification queue.
 *
 * @param[inout]  p_ptr  Pointer to the index to increment.
 */
static void ntf_queue_ptr_increment(uint8_t * p_ptr)
{
    queue_ptr_increment(p_ptr, NTF_QUEUE_SIZE);
}

/**
 * Check if notification queue is full.
 *
 * @retval  true   Notification queue is full.
 * @retval  false  Notification queue is not full.
 */
static bool ntf_queue_is_full(void)
{
    return queue_is_full(m_ntf_r_ptr, m_ntf_w_ptr, NTF_QUEUE_SIZE);
}

/**
 * Check if notification queue is empty.
 *
 * @retval  true   Notification queue is empty.
 * @retval  false  Notification queue is not empty.
 */
static bool ntf_queue_is_empty(void)
{
    return queue_is_empty(m_ntf_r_ptr, m_ntf_w_ptr);
}

/**
 * Enter notify block.
 *
 * This is a helper function used in all notification functions to atomically
 * find an empty slot in the notification queue and allow atomic slot update.
 *
 * @return Pointer to an empty slot in the notification queue.
 */
static nrf_802154_ntf_data_t * ntf_enter(void)
{
    __disable_irq();
    __DSB();
    __ISB();

